# Даны два многочлена, 
# которые вводит пользователь. 
# как две строки.
# Задача - сформировать многочлен, 
# содержащий сумму многочленов, и вывести как строку.

# Степени многочленов могут быть разные.

# например на входе 2x^2 + 4x + 5 = 0 и 5x^3 - 3*x^2 - 12 = 0
# на выходе будет 5x^3 - x^2 + 4х - 7 = 0
# можно использовать модуль re

# polynomial_1 = input ("Введите первый многочлен: ")
# polynomial_2 = input ("Введите второй многочлен: ")


# from sympy import *
# import re
# s = 'P = 3x^2 + 2x + 7'.replace(' ', '')
# poly = []
# for term in re.findall(r'[+-]?\d*\w+\^?\d*', s):
#      term = re.sub(r'(\d*)([A-Za-z]\w*)(.*)', r'\1*\2\3', term)
#      term = term.replace('^', '**')
#      poly.append(term)
# print(poly)
# # poly
# # ['*P', '3*x**2', '+2*x', '+7']
# poly[0]=poly[0][1:]+'='
# poly = ''.join(poly)
# print(poly)
# # 'P=3*x**2+2*x+7'

# P =sympify(poly[2:])
# print(P)
# # 3*x**2 + 2*x + 7