''' В настольной игре Скрабл (Scrabble) 
каждая буква имеет определенную ценность.
В случае с английским алфавитом очки распределяются так:

A, E, I, O, U, L, N, S, T, R – 1 очко;
D, G – 2 очка;
B, C, M, P – 3 очка;
F, H, V, W, Y – 4 очка;
K – 5 очков;
J, X – 8 очков;
Q, Z – 10 очков.

А русские буквы оцениваются так:

А, В, Е, И, Н, О, Р, С, Т – 1 очко;
Д, К, Л, М, П, У – 2 очка;
Б, Г, Ё, Ь, Я – 3 очка;
Й, Ы – 4 очка;
Ж, З, Х, Ц, Ч – 5 очков;
Ш, Э, Ю – 8 очков;
Ф, Щ, Ъ – 10 очков.

Напишите программу, 
которая вычисляет стоимость введенного пользователем слова k
и выводит его. 
Будем считать, что 
на вход подается только одно слово, 
которое содержит либо только английские, 
либо только русские буквы.'''

# __________________________________МОЁ РЕШЕНИЕ________________________________
import re

point_en = {
        1:'AEIOULNSTR', 
      	2:'DG',
      	3:'BCMP',
      	4:'FHVWY',
      	5:'K',
      	8:'JX',
      	10:'QZ'}
point_ru = {
        1:'АВЕИНОРСТ',
      	2:'ДКЛМПУ',
      	3:'БГЁЬЯ',
      	4:'ЙЫ',
      	5:'ЖЗХЦЧ',
      	8:'ШЭЮ',
      	10:'ФЩЪ'}

point_sum = 0

word = input('Введите слово для подсчёта: ') 
word = word.upper()
check = bool(re.search('[A-Z]', word))

if check:
    for i in word:
        for key, value in point_en.items():
             for iv in value:
                 if iv == i:
                	 point_sum += key
else:
        for i in word:
               for key, value in point_ru.items():
                      for iv in value:
                              if iv == i:
                                      point_sum += key
print(point_sum)


# # ______решение 1___________________________________________________________________
        
#     # функция, которая возвращает "правда", если слово на русском, и "ложь", если на английском
# def russian(slovo):
# 	return bool(re.search('[а-яА-Я]', slovo))
# # создаем словари, где ключами будут очки, а значениями – строки из букв
# ochki_en = {
#         1:'AEIOULNSTR',
#       	2:'DG',
#       	3:'BCMP',
#       	4:'FHVWY',
#       	5:'K',
#       	8:'JZ',
#       	10:'QZ'}
# ochki_ru = {
#         1:'АВЕИНОРСТ',
#       	2:'ДКЛМПУ',
#       	3:'БГЁЬЯ',
#       	4:'ЙЫ',
#       	5:'ЖЗХЦЧ',
#       	8:'ШЭЮ',
#       	10:'ФЩЪ'}
# print("Введи слово:")
# slovo = input().upper()

# # Метод items() позволяет обращаться к ключам и значениям одновременно – если очередная 
# # буква в слове входит в одно из значений, генератор добавит ключ в список, 
# # а метод списка sum() подсчитает стоимость всего слова:
# if russian(slovo):
# 	print(sum([k for i in slovo for k, v in ochki_ru.items() if i in v]))
# else:
# 	print(sum([k for i in slovo for k, v in ochki_en.items() if i in v]))

# ________метод в минимуме____________________________________________________________________

# ochki_en = {
#     "name": "PythonTurbo",
#      "acronym": "PT"}

# slovarZnachen = ochki_en.items()

# iskomoeZnachenie = input('введите значение: ')

# for key, value in slovarZnachen:
#     if value == iskomoeZnachenie:
#         print(key)

# # ________решение 3 Айк ____________________________________________________________________________

# list_letters = {1:"AaEeIiOoUuLlNnSsTtRrАаВвЕеИиНнОоРрСсТт",
#                 2:"DdGgДдКкЛлМмПпУу",
#                 3:"BbCcMmPpБбГгЁёЬьЯя",
#                 4:"FfHhVvWwYyЙйЫы",
#                 5:"KkЖжЗзХхЦцЧч",
#                 8:"JjXxШшЭэЮю",
#                 10:"QqZzФфЩщЪъ"}

# summ = 0
# for i in k:
#     for x, y in list_letters.items():
#         if i in y:
#             summ = summ + x
# print(summ)

# # ----------решение 4 Максим -----------------------------------------------------

# diction  = {
#     "A": 1, "E": 1, "I": 1, "O": 1, "U": 1, "L": 1, "N": 1, "S": 1, "T": 1, "R": 1, "D": 2, "G": 2, "B": 3, "C": 3, "M": 3, "P": 3, "F": 4, "H": 4, "V": 4, "W": 4, "Y": 4, "K": 5, "J": 8, "X": 8, "Q": 10, "Z": 10, "А": 1, "В": 1, "Е": 1, "И": 1, "Н": 1, "О": 1, "Р": 1, "С": 1, "Т": 1, "Д": 2, "К": 2, "Л": 2, "М": 2, "П": 2, "У": 2, "Б": 3, "Г": 3, "Ё": 3, "Ь": 3, "Я": 3, "Й": 4, "Ы": 4, "Ж": 5, "З": 5, "Х": 5, "Ц": 5, "Ч": 5, "Ш": 8, "Э": 8, "Ю": 8, "Ф": 10, "Щ": 10, "Ъ": 10 
# }

# k = input("Input a word: ")
# result = sum(diction.get(letter.upper(), 0) for letter in k)
# print(result)


# # _____________________решение 5 Андрей______________________________________

# my_dict = {
#     'A': 1, 'E': 1, 'I': 1, 'O': 1, 'U': 1, 'L': 1, 'N': 1, 'S': 1, 'T': 1, 'R': 1, 'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1,'О': 1, 'Р': 1, 'С': 1, 'Т': 1, 'D': 2, 'G': 2, 'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2, 'B': 3, 'C': 3, 'M': 3, 'P': 3, 'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3, 'F': 4, 'H': 4, 'V': 4, 'W': 4, 'Y': 4, 'Й': 4, 'Ы': 4, 'K': 5, 'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 'J': 8, 'X': 8, 'Ш': 8, 'Э': 8, 'Ю': 8, 'Q': 10, 'Z': 10, 'Ф': 10, 'Щ': 10, 'Ъ': 10}

# word = input().upper()
# sum = 0
# for i in word:
#     sum += my_dict[i]
# print(f'Стоимость введённого слова равна: {sum}')